app/Controllers/Home.php

SELECT *
FROM `products`
---
    public function index(): string
    {

        $products = new ProductModel();

        $allProducts = $products->findAll();