app/Models/ProductModel.php

    public function create($data) {
        return $this->save($data);
---
INSERT INTO `products` (`title`, `price`, `description`, `quantity`) VALUES ('teste', '1.99', 'asfsfafsf', '455')

    public function edit($id, $data) {
        return $this->update($id, $data);
---
UPDATE `products` SET `title` = 'teste', `price` = '2', `description` = 'eeeeeeeeeeee', `quantity` = '455'
WHERE `products`.`id` IN ('1')

    public function deleteProduct($id){
        return $this->delete($id);
---
DELETE FROM `products`
WHERE `id` IN ('1')